#!/bin/bash

# =============================================
# Цвета
# =============================================
ERR='\033[0;31m'
SUC='\033[0;32m'
WARN='\033[0;33m'
INF='\033[36m'
NC='\033[0m' # No Color - без цвета

# =============================================
# Настройки
# =============================================
TEST_DIR="boost/test"
BUILD_DIR="${TEST_DIR}/build"
LOG_DIR="${TEST_DIR}/logs"
LOG_FILE="${LOG_DIR}/benchmark.log"

# Создание директорий
echo -e "${INF}Создание структуры директорий...${NC}"
mkdir -p "${TEST_DIR}"
mkdir -p "${BUILD_DIR}"
mkdir -p "${LOG_DIR}"

# Очистка предыдущего лога
> "${LOG_FILE}"