#!/bin/bash

set -euo pipefail

# =============================================
# Цвета
# =============================================
ERR='\033[0;31m'
SUC='\033[0;32m'
WARN='\033[0;33m'
INF='\033[36m'
NC='\033[0m' # No Color - без цвета

# =============================================
# Action
# =============================================
echo -e "${INF}Переходим к boost-тестам${NC}"
boost/actix.sh

echo -e "${INF}Переходим к alloc-тестам${NC}"
alloc/actix.sh

echo -e "${SUC}Всё готово!${NC}"